import styles from "./Facts.module.css";
import Fact from "./Fact/Fact";

const facts = [
  [
    "Ваши заявки обрабатываются мгновенно, для сохранения Вашего клиента и Вашего дохода.",
    "Скорость",
  ],
  [
    "С нашей уникальной системой мы предотвращаем проблемы с интернетом, заботясь о Ваших клиентах даже до того, как они обратятся за помощью.",
    "Контроль",
  ],
  [
    "84 партнёра подтвердили: ключ к гарантированному успеху в обработке их клиентов – это наша платформа.",
    "Платформа",
  ],
];

const Facts = () => {
  return (
    <div className={styles.main}>
      <h2>Преимущества нашей платформы</h2>
      {facts.map((fact, index) => (
        <Fact key={index} desc={fact[0]} title={fact[1]} />
      ))}
    </div>
  );
};

export default Facts;
